Revit 2026 API

# DockablePane Class

---

A user interface pane that participates in Revit's docking window system.

SystemObject Autodesk.Revit.UIDockablePane

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DockablePane : IDisposable
```
```vb
Public Class DockablePane
	Implements IDisposable
```
```cpp
public ref class DockablePane : IDisposable
```
```fsharp
type DockablePane =
    class
        interface IDisposable
    end
```

The DockablePane type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DockablePane(DockablePane) | Constructs a new copy of the input DockablePane object. |
|  | DockablePane(DockablePaneId) | Gets the pane with identifier %id%. |

|  | Name | Description |
| --- | --- | --- |
|  | Id | The unique identifier for this dockable pane. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DockablePane |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetTitle | Returns the current title (a.k.a. window caption) of the dockable pane. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Hide | If the pane is on screen, hide it. Has no effect on built-in Revit dockable panes. |
|  | IsShown | Identify the pane is currently visible or in a tab. |
|  | PaneExists | Returns true if %id% refers to a dockable pane window that currently exists in the Revit user interface, whether it's hidden or shown. |
|  | PaneIsBuiltIn | Returns true if %id% refers to a built-in Revit dockable pane, rather than one created by an add-in. |
|  | PaneIsRegistered | Returns true if %id% refers to a built-in Revit dockable pane, or an add-in pane that has been properly registered with %Autodesk.Revit.UI.UIApplication.RegisterDockablePane%. |
|  | Show | If the pane is not currently visible or in a tab, display the pane in the Revit user interface at its last docked location. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI Namespace